Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенПоставщикам/TK_ЗапросЦенПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_ЗапросЦенПоставщикам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.TK_ТипыЗапросовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/Enums/TK_СтатусыПубликацииДокументовНаTeklifo/TK_СтатусыПубликацииДокументовНаTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TK_СтатусыПубликацииДокументовНаTeklifo</name>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>НеОпубликован</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОбновление</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенПоставщикам/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Менеджер = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Ссылка) Тогда
		ТекущийСтатус = Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.ПустаяСсылка();
		ДокументИзменен = Ложь;
	Иначе
		ТекущийСтатус = TK_ОбщегоНазначенияВызовСервера.СтатусПубликацииЗапросаЦенПоставщикам(Ссылка);
		ДокументИзменен = ОбменДаннымиСобытия.ДанныеРазличаются(ЭтотОбъект, Ссылка.ПолучитьОбъект(), ,
			"Комментарий, Менеджер");
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ТекущийСтатус", ТекущийСтатус);
	ДополнительныеСвойства.Вставить("ДокументИзменен", ДокументИзменен);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекущийСтатус = Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.ПустаяСсылка();
	ДокументИзменен = Ложь;

	ДополнительныеСвойства.Свойство("ТекущийСтатус", ТекущийСтатус);
	ДополнительныеСвойства.Свойство("ДокументИзменен", ДокументИзменен);

	Если Не ЗначениеЗаполнено(ТекущийСтатус) Тогда
		TK_ОбщегоНазначенияВызовСервера.УстановитьСтатусПубликацииЗаказаЦенПоставщикам(Ссылка,
			Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.НеОпубликован);
	ИначеЕсли ТекущийСтатус = Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.Опубликован И ДокументИзменен Тогда
		TK_ОбщегоНазначенияВызовСервера.УстановитьСтатусПубликацииЗаказаЦенПоставщикам(Ссылка,
			Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.ТребуетсяОбновление);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
